onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Neto_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.Neto_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Neto_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	//	//{{Kusakina O.A. Создание команды согласованная скидка
	КомандаСкидка = Команды.Добавить("ПрименитьСкидку");
	КомандаСкидка.Заголовок = "Применить скидку";
	КомандаСкидка.Действие = "КомандаСкидкаНажатие"; 
	Кнопка = Элементы.Добавить("КнопкаСкидки", Тип("КнопкаФормы"), Элементы.ГруппаКолонкиШапки);
	Кнопка.ИмяКоманды = "ПрименитьСкидку";
	Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	//Kusakina O.A.}
		//{{Kusakina O.A. Добавление контактного лица
	ДобавляемыеРеквизиты=Neto_ДобавлениеКонтактногоЛица.ДобавлениеКонтактногоЛицаВДокумент(Элементы);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Neto_ДобавлениеКонтактногоЛица.NetoПолеФормы(Элементы);
	
		//{{Kusakina O.A.Добавление реквизита согласованная скидка на форму
    ДобавляемыеРеквизиты=Neto_ДобавлениеКонтактногоЛица.ДобавлениеСогласованнаяСкидка(Элементы);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Neto_ДобавлениеКонтактногоЛица.NetoПолеФормыСогласованнаяСкидка(Элементы);
	//СогласованнаяCкидкаПриИзменении(Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

//{{Kusakina O.A. Команда согласованная скидка

#Область ОбработчикиКомандыФормы 

 
//{{Kusakina O.A. Команда согласованная скидка
&НаКлиенте
Процедура КомандаСкидкаНажатие(Команда)
	//{{Kusakina O.A. Команда согласованная скидка
	КомандаСкидкаНажатиеЦикл(); 
	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаСервере
Процедура КомандаСкидкаНажатиеЦикл()  
	//{{Kusakina O.A. Команда согласованная скидка
	СписокНоменклатуры = Новый Массив;
	Для Каждого СтрТовара из Объект.Товары Цикл 
		Если  ЗначениеЗаполнено(СтрТовара.Номенклатура) И СписокНоменклатуры.Найти(СтрТовара.Номенклатура) = Неопределено Тогда 
			СписокНоменклатуры.Добавить(СтрТовара.Номенклатура);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Neto_СогласованнаяСкидка) > 0 Тогда  
			Коэф1 = (СтрТовара.Цена * СтрТовара.Количество*СтрТовара.Скидка/100);
			Коэф2 = ((СтрТовара.Цена * СтрТовара.Количество-Коэф1)*Объект.Neto_СогласованнаяСкидка/100);
			СтрТовара.Сумма = (СтрТовара.Цена * СтрТовара.Количество) - Коэф1-Коэф2;
			Сообщить(СтрШаблон("Применена скидка %1%%  на товар %2", Объект.Neto_СогласованнаяСкидка, СтрТовара.Номенклатура));
		Иначе
			Коэф1 = (СтрТовара.Цена * СтрТовара.Количество*СтрТовара.Скидка/100);
			СтрТовара.Сумма = СтрТовара.Цена * СтрТовара.Количество-Коэф1;
		КонецЕсли; 
		
	КонецЦикла; 
	Для Каждого СтрТовара из Объект.Услуги Цикл 
		Если  ЗначениеЗаполнено(СтрТовара.Номенклатура) И СписокНоменклатуры.Найти(СтрТовара.Номенклатура) = Неопределено Тогда 
			СписокНоменклатуры.Добавить(СтрТовара.Номенклатура);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Neto_СогласованнаяСкидка) > 0 Тогда  
			Коэф1 = (СтрТовара.Цена * СтрТовара.Количество*СтрТовара.Скидка/100);
			Коэф2 = ((СтрТовара.Цена * СтрТовара.Количество-Коэф1)*Объект.Neto_СогласованнаяСкидка/100);
			СтрТовара.Сумма = (СтрТовара.Цена * СтрТовара.Количество) - Коэф1 - Коэф2;
			Сообщить(СтрШаблон("Применена скидка %1%%  на услугу %2", Объект.Neto_СогласованнаяСкидка, СтрТовара.Номенклатура));
		Иначе 
			Коэф1 = (СтрТовара.Цена * СтрТовара.Количество*СтрТовара.Скидка/100);
			СтрТовара.Сумма = СтрТовара.Цена * СтрТовара.Количество-Коэф1;
		КонецЕсли; 
		
	КонецЦикла;
	//Kusakina O.A.}}
	КонецПроцедуры
//Kusakina O.A.}}
#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
